reports/lab3/k6-2cpu-50.txt


  █ THRESHOLDS 

    predict_failures
    ✓ 'rate<0.01' rate=0.00%

    predict_latency_ms
    ✗ 'p(95)<250' p(95)=1001.175245


  █ TOTAL RESULTS 

    checks_total.......: 10812   339.172396/s
    checks_succeeded...: 100.00% 10812 out of 10812
    checks_failed......: 0.00%   0 out of 10812

    ✓ status is 200
    ✓ probability present
    ✓ version reported

    CUSTOM
    predict_failures...............: 0.00%  0 out of 3604
    predict_latency_ms.............: avg=430.848301 min=65.842744 med=329.709276 p(95)=1001.175245 p(99)=1121.345728 max=1635.67114

    HTTP
    http_req_duration..............: avg=430.84ms   min=65.84ms   med=329.7ms    p(95)=1s          p(99)=1.12s       max=1.63s     
      { expected_response:true }...: avg=430.84ms   min=65.84ms   med=329.7ms    p(95)=1s          p(99)=1.12s       max=1.63s     
    http_req_failed................: 0.00%  0 out of 3604
    http_reqs......................: 3604   113.057465/s

    EXECUTION
    iteration_duration.............: avg=421.79ms   min=65.98ms   med=324ms      p(95)=986.29ms    p(99)=1.05s       max=1.15s     
    iterations.....................: 3604   113.057465/s
    vus............................: 3      min=3         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 1.3 MB 41 kB/s
    data_sent......................: 950 kB 30 kB/s



time="2026-09-22T10:22:32Z" level=error msg="thresholds on metrics 'predict_latency_ms' have been crossed"