reports/lab3/k6-bp-c2.txt


  █ THRESHOLDS 

    predict_failures
    ✓ 'rate<0.01' rate=0.00%

    predict_latency_ms
    ✓ 'p(95)<250' p(95)=99.260188


  █ TOTAL RESULTS 

    checks_total.......: 2154    69.621231/s
    checks_succeeded...: 100.00% 2154 out of 2154
    checks_failed......: 0.00%   0 out of 2154

    ✓ status is 200
    ✓ probability present
    ✓ version reported

    CUSTOM
    predict_failures...............: 0.00%  0 out of 718
    predict_latency_ms.............: avg=85.754713 min=60.975095 med=82.930907 p(95)=99.260188 p(99)=122.103927 max=524.192099

    HTTP
    http_req_duration..............: avg=85.75ms   min=60.97ms   med=82.93ms   p(95)=99.26ms   p(99)=122.1ms    max=524.19ms  
      { expected_response:true }...: avg=85.75ms   min=60.97ms   med=82.93ms   p(95)=99.26ms   p(99)=122.1ms    max=524.19ms  
    http_req_failed................: 0.00%  0 out of 718
    http_reqs......................: 718    23.207077/s

    EXECUTION
    iteration_duration.............: avg=83.64ms   min=61.19ms   med=83.09ms   p(95)=99.23ms   p(99)=118.85ms   max=194.17ms  
    iterations.....................: 718    23.207077/s
    vus............................: 2      min=2        max=2
    vus_max........................: 2      min=2        max=2

    NETWORK
    data_received..................: 193 kB 6.2 kB/s
    data_sent......................: 170 kB 5.5 kB/s