reports/lab3/k6-bp-c20.txt


  █ THRESHOLDS 

    predict_failures
    ✓ 'rate<0.01' rate=0.00%

    predict_latency_ms
    ✗ 'p(95)<250' p(95)=428.603903


  █ TOTAL RESULTS 

    checks_total.......: 6705    214.861062/s
    checks_succeeded...: 100.00% 6705 out of 6705
    checks_failed......: 0.00%   0 out of 6705

    ✓ status is 200
    ✓ probability present
    ✓ version reported

    CUSTOM
    predict_failures...............: 0.00%  0 out of 2235
    predict_latency_ms.............: avg=276.804045 min=71.061432 med=257.163936 p(95)=428.603903 p(99)=671.950322 max=1245.097294

    HTTP
    http_req_duration..............: avg=276.8ms    min=71.06ms   med=257.16ms   p(95)=428.6ms    p(99)=671.95ms   max=1.24s      
      { expected_response:true }...: avg=276.8ms    min=71.06ms   med=257.16ms   p(95)=428.6ms    p(99)=671.95ms   max=1.24s      
    http_req_failed................: 0.00%  0 out of 2235
    http_reqs......................: 2235   71.620354/s

    EXECUTION
    iteration_duration.............: avg=269.82ms   min=71.29ms   med=256.42ms   p(95)=419.25ms   p(99)=466.04ms   max=522.6ms    
    iterations.....................: 2235   71.620354/s
    vus............................: 20     min=20        max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 712 kB 23 kB/s
    data_sent......................: 562 kB 18 kB/s



time="2026-09-22T09:58:38Z" level=error msg="thresholds on metrics 'predict_latency_ms' have been crossed"